// 변수는 어떤 정보에 이름을 붙여서 저장하고 싶을 때 사용

//name = "Mike"; // 문자는 항상 "따옴표"로 감싸줘야 한다
//age = 30;


//console.log(name); // 경고창을 띄우는 함수
//console.log(age); // 콘솔을 찍는 함수 

// console.log() 실행 단축키 Ctrl + Alt + N
// 또는 우측 상단에 ▶ 버튼 누르면 실행 

// alert는 vs코드에서는 실행x

let name = "Mike";
name = "google";

 console.log(name);

// 이미 name은 선언되어있다 구문오류 발생

// const 절대로 바뀌지 않는 상수, 수정x
// 대문자로 작성


// 모든 변수를 일단 const로 선언하고 변경될 여지가 있을 때 let으로 변경!

// 주의사항
// 1. 변수는 문자와 숫자, $와 _만 사용
// 2. 첫글자는 숫자가 될 수 없다
// 3. 예약어는 사용할 수 없다 
// 4. 가급적 상수는 대문자로 작성
// 5. 변수명은 읽기 쉽고 이해할 수 있게 선언 


